In [1]:
student={'Name':['Amandeep_Singh','Srajan_Jaiswal','Aman_Saraogi','Vibhor_Singh'],
          'Age':[20,21,19,20],
          'City':['Lucknow','Kanpur','Jhansi','Dehradun'],
          'email':['amandeep@gmail.com','jaiswalsrajan@gmail.com','aman@gmail.com','vibhu@gmail.com']
        }

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(student)   #creating data frames

In [4]:
df

             Name  Age      City                    email
0  Amandeep_Singh   20   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal   21    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi   19    Jhansi           aman@gmail.com
3    Vibhor_Singh   20  Dehradun          vibhu@gmail.com

In [5]:
df.columns        #it gives us the columns name

Index(['Name', 'Age', 'City', 'email'], dtype='object')

In [6]:
df.columns=['fname','fage','fcity','femail']            #change the columns name

In [7]:
df

            fname  fage     fcity                   femail
0  Amandeep_Singh    20   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal    21    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi    19    Jhansi           aman@gmail.com
3    Vibhor_Singh    20  Dehradun          vibhu@gmail.com

In [8]:
df.columns=[x.upper() for x in df.columns]                   #using list comprehension to change columns name to upper case

In [9]:
df            #now column name becomes upper case

            FNAME  FAGE     FCITY                   FEMAIL
0  Amandeep_Singh    20   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal    21    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi    19    Jhansi           aman@gmail.com
3    Vibhor_Singh    20  Dehradun          vibhu@gmail.com

In [22]:
df.columns=['Name','Age','City','email']

In [23]:
df

             Name  Age      City                    email
0  Amandeep_Singh   20   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal   21    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi   19    Jhansi           aman@gmail.com
3    Vibhor_Singh   20  Dehradun          vibhu@gmail.com

In [26]:
df.loc[0]              #for getting row at 0

Name         Amandeep_Singh
Age                      20
City                Lucknow
email    amandeep@gmail.com
Name: 0, dtype: object

In [29]:
df.loc[2,['Name','email']]

Name       Aman_Saraogi
email    aman@gmail.com
Name: 2, dtype: object

In [30]:
df.loc[::-1]

             Name  Age      City                    email
3    Vibhor_Singh   20  Dehradun          vibhu@gmail.com
2    Aman_Saraogi   19    Jhansi           aman@gmail.com
1  Srajan_Jaiswal   21    Kanpur  jaiswalsrajan@gmail.com
0  Amandeep_Singh   20   Lucknow       amandeep@gmail.com

In [34]:
df.at[0,'Name']             #at can also be used to access value

'Amandeep_Singh'

In [32]:
df['email'].str.upper()           # it converts email to upper case

0         AMANDEEP@GMAIL.COM
1    JAISWALSRAJAN@GMAIL.COM
2             AMAN@GMAIL.COM
3            VIBHU@GMAIL.COM
Name: email, dtype: object

In [35]:
df['email'].str.lower()          # it converts email back to lower case

0         amandeep@gmail.com
1    jaiswalsrajan@gmail.com
2             aman@gmail.com
3            vibhu@gmail.com
Name: email, dtype: object

In [36]:
df['email'].apply(len)      #length of email

0    18
1    23
2    14
3    15
Name: email, dtype: int64

In [37]:
df

             Name  Age      City                    email
0  Amandeep_Singh   20   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal   21    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi   19    Jhansi           aman@gmail.com
3    Vibhor_Singh   20  Dehradun          vibhu@gmail.com

In [41]:
df['email']=df['email'].apply(lambda x:x.upper())

In [45]:
df

0         AMANDEEP@GMAIL.COM
1    JAISWALSRAJAN@GMAIL.COM
2             AMAN@GMAIL.COM
3            VIBHU@GMAIL.COM
Name: email, dtype: object